"""
2023/10/29 00:00|Домашняя работа по уроку "Различие атрибутов класса и экземпляра."
Домашнее задание по уроку "Различие атрибутов класса и экземпляра"
Создайте новый проект в PyCharm
Запустите созданный проект
Ваша задача:
Создайте новый класс Buiding с атрибутом total
Создайте инициализатор для класса Buiding
, который будет увеличивать атрибут количества созданных объектов класса Building total
 (по примеру класса Lemming
 из урока
)
В цикле создайте 40 объектов класса Building
 и выведите их на экран командой print
Полученный код напишите в ответ к домашнему заданию
Урок "Различие атрибутов класса и экземпляра"
"""
