"""
2023/10/05 00:00|Домашняя работа по уроку "Пространство имен и способы вызова функции"
Домашнее задание по уроку "Пространство имен и способы вызова функции"
Для работы над домашнем заданием:
1. Создайте новый проект в PyCharm
Ваша задача в файле main.py:
Создайте новую функцию def test...
Создайте две переменные a и b внутри пространства имен функции test
Распечатайте a и b внутри функции test
Создайте функцию def test2 с тремя параметрами, функция должна распечатывать все три параметра внутри своего тела
В ответ прикрепите получившийся файл main.py
Урок "Пространство имен"
Урок "Способы вызова функции по умолчанию"
Часто задаваемые вопросы:
функция без параметров (аргументов) #объявление функции
def function_1():
#тело функции a = 10
print(a)
вызов функции без аргументов - имя функции и обязательно круглые скобки
function_1() функция с параметрами (аргументами)
def function_params(param1, param2):
print(param1, param2)
вызов функции - имя функции и обязательно параметры в круглых скобках
function_params("I learn","Python")
"""
