"""
2023/10/09 00:00|Самостоятельная работа по уроку "Произвольное число параметров и HTML_DOM"
Самостоятельная работа по уроку "Произвольное число параметров и HTML_DOM"
Для работы над домашнем заданием:
1. Создайте новый проект в PyCharm
Ваша задача в файле main.py:
Создайте новую функцию def test... с произвольным числом параметров разного типа, функция должна распечатывать эти параметры внутри своего тела
Создайте рекурсивную функцию, которая будет считать факториал от числа n, n - передается в параметре
В ответ прикрепите получившийся файл main.py
Урок "Функции и произвольное число параметров"
Урок "Рекурсия и HTML_DOM"
"""
