"""
2023/10/27 00:00|Домашняя работа по уроку "Специальные методы классов"
Домашнее задание по уроку "Пространство имен"
Создайте новый проект в PyCharm
Запустите созданный проект
Ваша задача:
Создайте новый класс House
Создайте инициализатор для класса House, который будет задавать атрибут этажности self.numberOfFloors = 0
Создайте метод setNewNumberOfFloors(floors), который будет изменять атрибут numberOfFloors на параметр floors и выводить в консоль numberOfFloors
Полученный код напишите в ответ к домашему заданию
Урок "Специальные методы класса"
"""
