"""
2023/12/31 00:00|Домашнее задание по теме "Интроспекция"
Цель задания:
Закрепить знания об интроспекции в Python.
Создать персональную функции для подробной интроспекции объекта.
Задание:
Необходимо создать функцию, которая принимает объект (любого типа) в качестве аргумента и проводит интроспекцию этого объекта, чтобы определить его тип, атрибуты, методы, модуль, и другие свойства.
1. Создайте функцию introspection_info(obj), которая принимает объект obj.
2. Используйте встроенные функции и методы интроспекции Python для получения информации о переданном объекте.
3. Верните словарь или строки с данными об объекте, включающий следующую информацию:
 - Тип объекта.
 - Атрибуты объекта.
 - Методы объекта.
 - Модуль, к которому объект принадлежит.
 - Другие интересные свойства объекта, учитывая его тип (
по желанию
).
Пример работы:
number_info = introspection_info(42)
print(number_info)
Вывод на консоль:
{'type': 'int', 'attributes': ['__abs__', '__add__', ...], 'methods': [], 'module': '__main__'}
Рекомендуется создавать свой класс и объект для лучшего понимания
Файл с кодом прикрепите к домашнему заданию.
"""
