"""
2023/09/29 00:00|Домашняя работа по уроку "Стиль кода часть II. Цикл While."
Самостоятельная работа по уроку "Стиль кода часть I и Стиль кода часть II"
1. Скачайте и запустите файл по ссылке
2. Запустите файл в Pycharm
3. Отформатируйте код по примерам из уроков
Ваша задача:
Переименуйте переменные, которые названы не в соответствии со стилем кода
Добавьте пробелы в коде в соответсвии со стилем кода (подчеркивания желтым)
Добавьте отсупы в коде в соответсвии со стилем кода (подчеркивания желтым)
Получившийся файл прикрепите для оценки домашнего задания
Уроки:
Стиль кода часть I.
Стиль кода часть II.
"""
