"""
2023/09/30 00:00|Домашняя работа по уроку "Цикл for. Элементы списка. Полезные функции в цикле"
Самостоятельная работа по уроку "Цикл for. Элементы списка. Полезные функции в цикле"
1. Создайте новый проект
2. Запустите новый проект в Pycharm
Ваша задача:
Создайте список из 5 машин - ["BMW", "MB", "LADA", "KIA", "HONDA"]
Создайте цикл for и в цикле распечатайте каждый из автомобилей в строке 'Я езжу на автомабиле марки'
Создайте целочисленную переменную cars_count = 0
Напишите в цикле из шага номер 2 увеличение переменной на 10 в каждом шаге цикла (cars_count += 10)
Посмотрите на консоль и на ход выполнения программы
Урок "Цикл for. Элементы списка. Полезные функции в цикле"
"""
