"""
2023/09/27 00:00|Самостоятельная работа по уроку "Цели и задачи. Поток выполнения программы."
Самостоятельная работа по уроку "Цели и задачи. Поток выполнения программы. Как интерпретатор показывает переменные."
1. Создайте новый проект
2. В файл main.py добавьте следующий код
print('Hi, PyCharm')
x = 43
y = 32
print(x * y)
print("End line")
Согласно скриншоту нажмите на самую первую строчку в коде на нумерации строк, чтобы поставить точку остановки (breakpoint)
Ваша задача:
Запустите проект
Пошагово запустите проект, нажмите на иконку дебага справа от запуска проекта "жучок"
В консоли посмотрите на результат программы
Используйте Step Over (см. скриншот) для перехода к следующему шагу выполнения программы
Посмотрите на консоль и на ход выполнения программы
Приложите скриншот (изображение), написанного кода
"""
