"""
2023/11/30 00:00|Домашнее задание по теме "Итераторы"
Цель работы
Применить dunder методы iter, next в своём классе
Задание
Напишите класс-итератор EvenNumbers для перебора чётных чисел в определённом числовом диапазоне. При создании и инициализации объекта этого класса создаются атрибуты:
start – начальное значение (если значение не передано, то 0)
end – конечное значение (если значение не передано, то 1)
Примечание
Значение атрибута start всегда меньше значения атрибута end
В решении задачи не использовать list, tuple и др. встроенные типы данных.
Входные данные
en = EvenNumbers(10, 25)
for i in en:
 print(i)
Выходные данные
После перебора и вывода:
10
12
14
16
18
20
22
24
"""
