"""
2023/12/26 00:00|Домашнее задание по теме "Виртуальные окружения"
Цель задания:
Освоить навык создания виртуальных окружений в Python.
Практически применить знания, загрузив проект с GitHub и и установить требуемые библиотеки.
Задание:
Необходимо создать пустой проект в PyCharm и клонировать репозиторий - https://github.com/yanchuki/pygame_example.git
Создать новое виртуальное окружение (назвать на своё усмотрение) и сделать его главным для проекта.
Активировать новое виртуальное окружение в консоли, предварительно деактивировав старое.
В новое виртуальное окружение загрузить необходимые пакеты при помощи файла зависимостей - requierments.txt.
Проверить работу программы.
Программа рисует круги разной формы и цвета при нажатии на мышку с каждой секундой.
Результат работы (примерный):
К домашнему заданию прикрепить:
Скриншоты древа проекта (развернутое). Должно присутствовать 2 окружения ('venv', 'ваше название')
Скриншот(-ы) с вызовами соответствующих pip - команд при выполнении ДЗ.
Рисунок получившийся у вас.
УДАЧИ!
"""
