"""
2023/10/28 00:00|Домашняя работа по уроку "Перегрузка операторов."
Домашнее задание по уроку "Перегрузка операторов"
Создайте новый проект в PyCharm
Запустите созданный проект
Ваша задача:
Создайте новый класс Buiding
Создайте инициализатор для класса Buiding, который будет задавать целочисленный атрибут этажности self.numberOfFloors и строковый атрибут self.buildingType
Создайте(перегрузите) __eq__, используйте атрибут numberOfFloors и buildingType для сравнения
Полученный код напишите в ответ к домашему заданию
Урок "Перегрузка операторов"
"""
