"""
2023/09/28 00:00|Домашняя работа по уроку "Условный оператор. Как работает оператор if."
Самостоятельная работа по уроку "Цели и задачи. Поток выполнения программы. Как интерпретатор показывает переменные."
1. Создайте новый проект в PyCharm
2. Запустите проект
3. Напишите и запустите блок кода, посмотрите на результат выполнения программы
4. Напишите и запустите блок кода, посмотрите на результат выполнения программы
6. Напишите и запустите блок кода, посмотрите на результат выполнения программы
7. Напишите и запустите блок кода, посмотрите на результат выполнения программы
8. Загрузите на свой GitHub репозиторий файл с кодом. Прикрепите ссылку на GitHub репозитория к домашнему заданию.
Уроки:
Условный оператор. Как работает оператор if.
"""
