"""
2024/01/24 00:00|Домашнее задание по теме "Дата и время"
Цель задания:
Повторить тему ООП, применив новые изученные модули даты и времени.
Создать усовершенствованный класс datetime.
Задание:
Создайте класс SuperDate
, наследованный от класса datetime
 модуля datetime
, объекты которого будут дополнительно обладать следующими методами:
1. get_season
 - должен возвращать сезон года (
Summer, Autumn, Winter, Spring
)
2. get_time_of_day
 - должен возвращать время суток (
Morning: 6-12; Day: 12-18, Evening: 18-0, Night: 0-6
) (
последнее число не включено в промежуток
)
Пример работы класса:
a = SuperDate(2024, 2, 22, 12)
print(a.get_season())
print(a.get_time_of_day())
Вывод на консоль:
Winter
Day
Примечание:
Для удобного хранения промежутков времени
 и номеров месяцев
 можно использовать словари
.
Файл с исходным кодом прикрепите к домашнему заданию.
Успеха!
"""
