"""
2023/11/05 00:00|Домашнее задание по теме "Наследование классов"
Создайте новый проект или продолжите работу в текущем проекте Ваша задача:
Создайте родительский(базовый) класс Car
, который имеет свойство price = 1000000 и функцию def horse_powers, которая возвращает количество лошидиных сил для автомобиля
Создайте наследника класса Car - класс Nissan
 и переопределите свойство price, а также переопределите функцию horse_powers
Дополнительно создайте класс Kia, который также будет наследником класса Car и переопределите также свойство price, а также переопределите функцию horse_powers
Получившийся код прикрепите к заданию текстом
"""
