"""
2023/10/01 00:00|Домашняя работа по уроку "Функции в Python.Функция с параметром"
Самостоятельная работа по уроку "Функции в Python.Функция с параметром"
1. Создайте новый проект
2. Запустите новый проект в Pycharm
Ваша задача:
Создайте функцию def print_params, которая в своем теле будет распечатывать переданное значение из параметра 2 раза!
Вызовите данную функцию несколько раз в том же файле
Запустите поэтапное выполнение программы, нажмите на иконку дебага справа от запуска проекта "жучок"
В консоли посмотрите на результат программы
Используйте Step Over (см. скриншот) для перехода к следующему шагу выполнения программы
Посмотрите на консоль и на ход выполнения программы
Урок "Функции в Python.Функция с параметром."
Часто задаваемые вопросы:
функция определяется так def f(arg):
print(arg)
Используется так f("I believe in miracles")
f(666)
"""
